import numpy as np

x = np.array([2,3,1,0])
x = np.array([2, 3, 1, 0])
x = np.array([[1,2.0],[0,0],(1+1j,3.)]) #허수 값을로 이루어진 배열
print(x)
x = np.array([[ 1.+0.j, 2.+0.j], [ 0.+0.j, 0.+0.j], [ 1.+1.j, 3.+0.j]]) #5행과 같은표현
print(x)

np.arange(10) #array([0, 1, 2, 3, 4, 5, 6, 7, 8, 9])
np.arange(2, 10, dtype=np.float) #array([ 2., 3., 4., 5., 6., 7., 8., 9.])
np.arange(2, 3, 0.1) #array([ 2. , 2.1, 2.2, 2.3, 2.4, 2.5, 2.6, 2.7, 2.8, 2.9]) , #2이상 3미만인 수들중 0.1간격으로 출력

np.linspace(1., 4., 6) #array([ 1. ,  1.6,  2.2,  2.8,  3.4,  4. ]) , 1이상 4이하인 수중 6개의 수를 선택
